wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
/**************************************************************************//**
 * @file     spim_cunit.c
 * @version  V1.00
 * $Revision: 1 $
 * $Date: 15/09/15 4:36p $
 * @brief    NUC4xx series SPIM CUnit test function.
 *
 * @note
 * Copyright (C) 2016 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/

//* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include "assert.h"

#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "spim_cunit.h"
#include "hyper_cunit.h"
#include "common.h"

//------------------------------------------------------------------------------
extern unsigned int STATE0;
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;

//------------------------------------------------------------------------------
static uint8_t idBuf[3] = {0};

static CMD_PHASE_T gRdCMDPhase_Windond[] =
{
    /* Commnad,  Dummy Cycle, Is4ByteAddress, Address Mode , Data Mode, Continue Mode, DTR Mode */
    {CMD_NORMAL_READ, 0, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, TRANS_MODE_NOR, 0}, //0x03
    {CMD_NORMAL_READ_4B, 0, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, TRANS_MODE_NOR, 0}, //0x13

    {CMD_FAST_READ, 8, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, TRANS_MODE_NOR, 0}, //0x0B
    {CMD_DTR_NORMAL_READ, 6, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, TRANS_MODE_NOR, 1}, //0x0D
    {CMD_FAST_READ_4B, 8, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, TRANS_MODE_NOR, 0}, //0x0C

    {CMD_DUAL_FAST_READ, 8, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_NOR, 0}, //0x3B
    {CMD_DUAL_FAST_READ_4B, 8, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_NOR, 0}, //0x3C

    {CMD_QUAD_FAST_READ, 8, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, TRANS_MODE_NOR, 0}, //0x6B
    {CMD_QUAD_FAST_READ_4B, 8, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, TRANS_MODE_NOR, 0}, //0x6C

    //Address and Data not Normal Mode
    { CMD_QUAD_FAST_IO_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_NOR, 0}, //0xEB
    { CMD_QUAD_FAST_IO_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_CONT, 0}, //0xEB

    { CMD_QUAD_FAST_DTR_READ, 7, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_NOR, 1}, //0xED
    { CMD_QUAD_FAST_DTR_READ, 7, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_CONT, 1}, //0xED

    { CMD_QUAD_FAST_IO_READ_4B, 4, 1, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_NOR, 0}, //0xEC
    { CMD_QUAD_FAST_IO_READ_4B, 4, 1, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_CONT, 0}, //0xEC

    //Dual Mode
    { CMD_DUAL_FAST_IO_READ, 0, 0, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_NOR, 0}, //0xBB Continue Read
    { CMD_DUAL_FAST_IO_READ, 0, 0, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_CONT, 0}, //0xBB Continue Read

    { CMD_DUAL_FAST_DTR_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_NOR, 1}, //0xBD Continue Read
    { CMD_DUAL_FAST_DTR_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_CONT, 1}, //0xBD Continue Read

    { CMD_DUAL_FAST_IO_READ_4B, 0, 1, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_NOR, 0}, //0xBC
    { CMD_DUAL_FAST_IO_READ_4B, 0, 1, PHASE_NORMAL_MODE, PHASE_DUAL_MODE, PHASE_DUAL_MODE, TRANS_MODE_CONT, 0}, //0xBC

    //Quad Wrap Around Mode
    { CMD_QUAD_FAST_IO_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_WRAP_16Bit, 0}, //0xEB
    { CMD_QUAD_FAST_IO_READ, 4, 0, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, PHASE_QUAD_MODE, TRANS_MODE_WRAP_16Bit | TRANS_MODE_CONT, 0}, //0xEB

    { 0, 0, 0, 0, 0, 0, 0}
};

static CMD_PHASE_T gWrCMDPhase_Windond[] =
{
    /* Commnad,  Dummy Cycle, Is4ByteAddress, Address Mode , Data Mode, Continue Mode, DTR Mode */
    {CMD_NORMAL_PAGE_PROGRAM, 0, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, 0, 0}, //0x02
    {CMD_NORMAL_PAGE_PROGRAM_4B, 0, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, 0, 0}, //0x12
    {CMD_QUAD_PAGE_PROGRAM_WINBOND, 0, 0, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, 0, 0}, //0x32
    {CMD_QUAD_PAGE_PROGRAM_WINBOND_4B, 0, 1, PHASE_NORMAL_MODE, PHASE_NORMAL_MODE, PHASE_QUAD_MODE, 0, 0}, //0x34
    { 0, 0, 0, 0, 0, 0, 0}
};

//------------------------------------------------------------------------------
void *GetWriteCMDPhaseTable(uint8_t u8CmdIdx)
{
    return &gWrCMDPhase_Windond[u8CmdIdx];
}

void *GetReadCMDPhaseTable(uint8_t u8CmdIdx)
{
    return &gRdCMDPhase_Windond[u8CmdIdx];
}

/*----------------------------------------------------------------------------*/
/* Test function                                                              */
/*----------------------------------------------------------------------------*/
void SPIMIrqHandle(SPIM_T *spim)
{
    printf("INT!\n");

    CU_ASSERT_TRUE((spim->CTL0 & SPIM_CTL0_IF_Msk));

    SPIM_CLR_INT(spim);

    CU_ASSERT_FALSE((spim->CTL0 & SPIM_CTL0_IF_Msk));
}

void SPIM1_IRQHandler(void)
{
    SPIM_T *pSPIMModule = (SPIM_T *)GetSPIMModule(C_SPIM1);

    //printf("INT!\n");

    //CU_ASSERT_TRUE(_SPIM_IS_IF_ON());
    //_SPIM_CLR_INT();
    //CU_ASSERT_FALSE(_SPIM_IS_IF_ON());
    SPIMIrqHandle(pSPIMModule);
}

void SPIM0_IRQHandler(void)
{
    SPIM_T *pSPIMModule = (SPIM_T *)GetSPIMModule(C_SPIM0);

    //printf("INT!\n");

    //CU_ASSERT_TRUE(_SPIM_IS_IF_ON());
    //_SPIM_CLR_INT();
    //CU_ASSERT_FALSE(_SPIM_IS_IF_ON());

    SPIMIrqHandle(pSPIMModule);
}

int SPIM_Tests_Init(void)
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    // SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);        /* Set SPIM clock as HCLK divided by 2 */

    // SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 2);    /* Insert 0 delay cycle. Adjust the sampling clock of received data to latch the correct data. */
    // SPIM_SET_RXCLKDLY_RDEDGE(pSPIMModule);         /* Use SPI input clock rising edge to sample received data. */
    // SPIM_SET_DC_DMAR(pSPIMModule, 8);              /* Set 8 dummy cycle. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0) /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");

        while (1);
    }

