wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n",
           idBuf[0],
           idBuf[1],
           idBuf[2]);

    // NVIC_EnableIRQ(CRPT_IRQn);

    return 0;
}

int SPIM_Tests_Clean(void)
{
    //NVIC_DisableIRQ(CRPT_IRQn);

    return 0;
}

/*----------------------------------------------------------------------------*/
/* Function: function_name                                                    */
/*                                                                            */
/* Parameters:                                                                */
/*               param - [in/out], parameter_description                      */
/*               param - [in/out], parameter_description                      */
/*                                                                            */
/* Returns:      the_value                                                    */
/* Side effects: the_effect                                                   */
/* Description:                                                               */
/*               description                                                  */
/*----------------------------------------------------------------------------*/
CU_SuiteInfo suites[] =
{
    //{"SPIM CONST", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_ConstantTests},
    //{"SPIM MACRO", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_MacroTests},
    {"SPIM API", SPIM_Tests_Init, SPIM_Tests_Clean, NULL, NULL, SPIM_ApiTests},

    CU_SUITE_INFO_NULL,
};

void spim_dma_read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32NRx, uint8_t *pu8RxBuf)
{
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);// Switch to Page Read mode.

    SPIM_SET_SPIM_MODE(spim, CMD_FAST_READ);    // SPIM mode.
    CU_ASSERT(SPIM_GET_SPIM_MODE(spim) == CMD_FAST_READ);

    SPIM_SET_4BYTE_ADDR_EN(spim, 0);            // Enable/disable 4-Byte Address.

    spim->SRAMADDR = (uint32_t) pu8RxBuf;       // SRAM u32Address.
    spim->DMACNT = BUFFER_SIZE;                 // Transfer length.
    spim->FADDR = 0;                            // Flash u32Address.
    SPIM_SET_GO(spim);                          // Go.
    CU_ASSERT_TRUE(SPIM_IS_BUSY(spim));

    SPIM_WAIT_FREE(spim);                       // Wait for DMA done.
}

void SPIM_Const_Address()
{
    switch (GetSPIMTestModuleIdx())
    {
        case C_SPIM0:
            CU_ASSERT(SPIM0_DMM_MAP_SADDR == 0x80000000UL);
            CU_ASSERT(SPIM0_DMM_MAP_NSADDR == 0x90000000UL);
            break;

        case C_SPIM1:
            CU_ASSERT(SPIM1_DMM_MAP_SADDR == 0x82000000UL);
            CU_ASSERT(SPIM1_DMM_MAP_NSADDR == 0x92000000UL);
            break;
    }

    CU_ASSERT(SPIM_DMM_SIZE == 0x2000000UL);
    //CU_ASSERT(SPIM_CCM_ADDR == 0x20020000);
    //CU_ASSERT(SPIM_CCM_SIZE == 0x8000);
}

void SPIM_Const_SPIM_CTL0()
{
    CU_ASSERT(SPIM_CTL0_RW_IN(0) == SPIM_CTL0_QDIODIR_Msk);

    CU_ASSERT(SPIM_CTL0_BITMODE_SING == (0UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_DUAL == (1UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_QUAD == (2UL << SPIM_CTL0_BITMODE_Pos));
    CU_ASSERT(SPIM_CTL0_BITMODE_OCTAL == (3UL << SPIM_CTL0_BITMODE_Pos));

    CU_ASSERT(SPIM_CTL0_OPMODE_IO == (0UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_PAGEWRITE == (1UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_PAGEREAD == (2UL << SPIM_CTL0_OPMODE_Pos));
    CU_ASSERT(SPIM_CTL0_OPMODE_DIRECTMAP == (3UL << SPIM_CTL0_OPMODE_Pos));

    //Read Byte Order Mode
    CU_ASSERT(SPIM_CTL0_RBO_MODE0 == (0UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE1 == (1UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE2 == (2UL << SPIM_CTL0_RBO_NORM_Pos));
    CU_ASSERT(SPIM_CTL0_RBO_MODE3 == (3UL << SPIM_CTL0_RBO_NORM_Pos));
}

void SPIM_Const_SPIM_CMDCODE()
{
    //--------------------------------------------------------------------------
    // I/O Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_NORMAL_PAGE_PROGRAM == (0x02));
    CU_ASSERT(CMD_NORMAL_PAGE_PROGRAM_4B == (0x12));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_WINBOND == (0x32));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_WINBOND_4B == (0x34));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_MXIC == (0x38));
    CU_ASSERT(CMD_QUAD_PAGE_PROGRAM_EON == (0x40));

    CU_ASSERT(CMD_OCTAL_PAGE_PROG_MICRON == (0x82UL));
    CU_ASSERT(CMD_OCTAL_PAGE_PROG_MICRON_4B == (0x84UL));
    CU_ASSERT(CMD_OCTAL_EX_PAGE_PROG_MICRON == (0xC2UL));
    CU_ASSERT(CMD_OCTAL_EX_PAGE_PROG_MICRON_4B == (0x8EUL));

    CU_ASSERT(CMD_NORMAL_READ == (0x03UL));
    CU_ASSERT(CMD_NORMAL_READ_4B == (0x13UL));
    CU_ASSERT(CMD_FAST_READ == (0x0BUL));
    CU_ASSERT(CMD_FAST_READ_4B == (0x0CUL));

    //--------------------------------------------------------------------------
    // Dual Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_DUAL_FAST_READ == (0x3BUL));
    CU_ASSERT(CMD_DUAL_FAST_READ_4B == (0x3CUL));
    CU_ASSERT(CMD_DUAL_FAST_IO_READ == (0xBBUL));
    CU_ASSERT(CMD_DUAL_FAST_IO_READ_4B == (0xBCUL));
    CU_ASSERT(CMD_DUAL_FAST_DTR_READ == (0xBDUL));

    //--------------------------------------------------------------------------
    // Quad Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_QUAD_FAST_READ == (0x6BUL));
    CU_ASSERT(CMD_QUAD_FAST_READ_4B == (0x6CUL));
    CU_ASSERT(CMD_QUAD_FAST_IO_READ == (0xEBUL));
    CU_ASSERT(CMD_QUAD_FAST_IO_READ_4B == (0xECUL));
    CU_ASSERT(CMD_QUAD_FAST_DTR_READ == (0xEDUL));

    //--------------------------------------------------------------------------
    // DTR Read Command
    //--------------------------------------------------------------------------
    CU_ASSERT(CMD_DTR_NORMAL_READ == (0x0DUL));
    CU_ASSERT(CMD_DTR_DUAL_READ == (0xBDUL));
    CU_ASSERT(CMD_DTR_QUAD_READ == (0xEDUL));

