wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
     *  _SPIM_SET_SS_EN(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_EN(pSPIMModule, 1);
    CU_ASSERT_FALSE(pSPIMModule->CTL1 & SPIM_CTL1_SS_Msk);
    SPIM_SET_SS_EN(pSPIMModule, 0);
    CU_ASSERT_TRUE(pSPIMModule->CTL1 & SPIM_CTL1_SS_Msk);

    /*
     *  _SPI_GET_SS_EN()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_EN(pSPIMModule, 1);
    CU_ASSERT_TRUE(SPIM_GET_SS_EN(pSPIMModule));
    SPIM_SET_SS_EN(pSPIMModule, 0);
    CU_ASSERT_FALSE(SPIM_GET_SS_EN(pSPIMModule));

    /*
     *  _SPI_SET_SS_ACTLVL(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_SS_ACTLVL(pSPIMModule, 0);
    CU_ASSERT_FALSE(pSPIMModule->CTL1 & SPIM_CTL1_SSACTPOL_Msk);
    SPIM_SET_SS_ACTLVL(pSPIMModule, 1);
    CU_ASSERT_TRUE(pSPIMModule->CTL1 & SPIM_CTL1_SSACTPOL_Msk);

    /*
     *  SPIM_SET_IDL_INTVL()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_IDL_INTVL(pSPIMModule, 3);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_IDLETIME_Msk) >> SPIM_CTL1_IDLETIME_Pos) == 0x03);
    SPIM_SET_IDL_INTVL(pSPIMModule, 6);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_IDLETIME_Msk) >> SPIM_CTL1_IDLETIME_Pos) == 0x06);

    /*
     *  SPIM_GET_IDL_INTVL()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_IDL_INTVL(pSPIMModule, 2);
    CU_ASSERT(SPIM_GET_IDL_INTVL(pSPIMModule) == 0x02);
    SPIM_SET_IDL_INTVL(pSPIMModule, 4);
    CU_ASSERT(SPIM_GET_IDL_INTVL(pSPIMModule) == 0x04);

    /*
     *  SPIM_SET_CLOCK_DIVIDER(x)
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 3);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_DIVIDER_Msk) >> SPIM_CTL1_DIVIDER_Pos) == 0x03);
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 6);
    CU_ASSERT(((pSPIMModule->CTL1 & SPIM_CTL1_DIVIDER_Msk) >> SPIM_CTL1_DIVIDER_Pos) == 0x06);

    /*
     *  SPIM_GET_CLOCK_DIVIDER()
     */
    pSPIMModule->CTL1 = 0;
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 2);
    CU_ASSERT(SPIM_GET_CLOCK_DIVIDER(pSPIMModule) == 0x02);
    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 4);
    CU_ASSERT(SPIM_GET_CLOCK_DIVIDER(pSPIMModule) == 0x04);

    CU_PASS();
}

void MACRO_SPIM_RXCLKDLY()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
#if 0
    /*
     *  _SPIM_SET_RXCLKDLY_DWDELSEL(x)
     */
    SPIM->RXCLKDLY = 0;
    _SPIM_SET_RXCLKDLY_DWDELSEL(3);
    CU_ASSERT(((SPIM->RXCLKDLY & SPIM_RXCLKDLY_DWDELSEL_Msk) >> SPIM_RXCLKDLY_DWDELSEL_Pos) == 0x03);
    CU_ASSERT(_SPIM_GET_RXCLKDLY_DWDELSEL() == 0x3);
    _SPIM_SET_RXCLKDLY_DWDELSEL(6);
    CU_ASSERT(((SPIM->RXCLKDLY & SPIM_RXCLKDLY_DWDELSEL_Msk) >> SPIM_RXCLKDLY_DWDELSEL_Pos) == 0x06);
    CU_ASSERT(_SPIM_GET_RXCLKDLY_DWDELSEL() == 0x6);

    /*
     *  _SPIM_SET_RXCLKDLY_DWDELSEL(x)
     */
    SPIM->RXCLKDLY = 0;
    _SPIM_SET_RXCLKDLY_DWDELSEL(3);
    CU_ASSERT(((SPIM->RXCLKDLY & SPIM_RXCLKDLY_DWDELSEL_Msk) >> SPIM_RXCLKDLY_DWDELSEL_Pos) == 0x03);
    _SPIM_SET_RXCLKDLY_DWDELSEL(6);
    CU_ASSERT(((SPIM->RXCLKDLY & SPIM_RXCLKDLY_DWDELSEL_Msk) >> SPIM_RXCLKDLY_DWDELSEL_Pos) == 0x06);
#endif //0

    /*
     *  SPIM_SET_RXCLKDLY_RDDLYSEL(x)
     */
    pSPIMModule->RXCLKDLY = 0;
    SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 2);
    CU_ASSERT(((pSPIMModule->RXCLKDLY & SPIM_RXCLKDLY_RDDLYSEL_Msk) >> SPIM_RXCLKDLY_RDDLYSEL_Pos) == 0x02);
    SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 3);
    CU_ASSERT(((pSPIMModule->RXCLKDLY & SPIM_RXCLKDLY_RDDLYSEL_Msk) >> SPIM_RXCLKDLY_RDDLYSEL_Pos) == 0x03);

    /*
     *  _SPIM_GET_RXCLKDLY_RDDLYSEL()
     */
    pSPIMModule->RXCLKDLY = 0;
    SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 3);
    CU_ASSERT(SPIM_GET_RXCLKDLY_RDDLYSEL(pSPIMModule) == 0x03);
    SPIM_SET_RXCLKDLY_RDDLYSEL(pSPIMModule, 1);
    CU_ASSERT(SPIM_GET_RXCLKDLY_RDDLYSEL(pSPIMModule) == 0x01);

#if 0
    /*
     *  _SPIM_SET_RXCLKDLY_RDEDGE() / _SPIM_CLR_RXCLKDLY_RDEDGE()
     */
    SPIM->RXCLKDLY = 0;
    _SPIM_SET_RXCLKDLY_RDEDGE();
    CU_ASSERT_TRUE(SPIM->RXCLKDLY & SPIM_RXCLKDLY_RDEDGE_Msk);
    _SPIM_CLR_RXCLKDLY_RDEDGE();
    CU_ASSERT_FALSE(SPIM->RXCLKDLY & SPIM_RXCLKDLY_RDEDGE_Msk);
    _SPIM_SET_RXCLKDLY_RDEDGE();
    CU_ASSERT_TRUE(SPIM->RXCLKDLY & SPIM_RXCLKDLY_RDEDGE_Msk);
#endif //0

    CU_PASS();
}

void MACRO_SPIM_DMMCTL()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());
#if 0
    /*
     *  _SPIM_SET_DMMCTL_CRMDAT(x)
     */
    SPIM->DMMCTL = 0;
    _SPIM_SET_DMMCTL_CRMDAT(0x7);
    CU_ASSERT(((SPIM->DMMCTL & SPIM_DMMCTL_CRMDAT_Msk) >> SPIM_DMMCTL_CRMDAT_Pos) == 0x7);
    _SPIM_SET_DMMCTL_CRMDAT(0xf1);
    CU_ASSERT(((SPIM->DMMCTL & SPIM_DMMCTL_CRMDAT_Msk) >> SPIM_DMMCTL_CRMDAT_Pos) == 0xf1);

    /*
     *  _SPIM_GET_DMMCTL_CRMDAT(x)
     */
    SPIM->DMMCTL = 0;
    _SPIM_SET_DMMCTL_CRMDAT(0x31);
    CU_ASSERT(_SPIM_GET_DMMCTL_CRMDAT() == 0x31);
    _SPIM_SET_DMMCTL_CRMDAT(0x8e);
    CU_ASSERT(_SPIM_GET_DMMCTL_CRMDAT() == 0x8e);

    /*
     *  _SPIM_DMM_SET_DESELTIM(x)
     */
    SPIM->DMMCTL = 0;
    _SPIM_DMM_SET_DESELTIM(0xe);
    CU_ASSERT(((SPIM->DMMCTL & SPIM_DMMCTL_DESELTIM_Msk) >> SPIM_DMMCTL_DESELTIM_Pos) == 0xe);
    _SPIM_DMM_SET_DESELTIM(0x11);
    CU_ASSERT(((SPIM->DMMCTL & SPIM_DMMCTL_DESELTIM_Msk) >> SPIM_DMMCTL_DESELTIM_Pos) == 0x11);

    /*
     *  _SPIM_DMM_GET_DESELTIM()
     */
    SPIM->DMMCTL = 0;
    _SPIM_DMM_SET_DESELTIM(0x13);
    CU_ASSERT(_SPIM_DMM_GET_DESELTIM() == 0x13);
    _SPIM_DMM_SET_DESELTIM(0xd);
    CU_ASSERT(_SPIM_DMM_GET_DESELTIM() == 0xd);
#endif //0

    /*
     *  SPIM_DMAM_SET_ACTSCLKT(x)
     */
    pSPIMModule->DMMCTL = 0;
    SPIM_DMAM_SET_ACTSCLKT(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->DMMCTL & SPIM_DMMCTL_ACTSCLKT_Msk) >> SPIM_DMMCTL_ACTSCLKT_Pos) == 0x3);
    CU_ASSERT_TRUE(pSPIMModule->DMMCTL & SPIM_DMMCTL_UACTSCLK_Msk);

    pSPIMModule->DMMCTL = 0;
    SPIM_DMAM_SET_ACTSCLKT(pSPIMModule, 0xcul);
    CU_ASSERT(((pSPIMModule->DMMCTL & SPIM_DMMCTL_ACTSCLKT_Msk) >> SPIM_DMMCTL_ACTSCLKT_Pos) == 0xc);
    CU_ASSERT_TRUE(pSPIMModule->DMMCTL & SPIM_DMMCTL_UACTSCLK_Msk);

    /*
     *  SPIM_DMAM_SET_ACTSCLKT(x)
     */
    pSPIMModule->DMMCTL = 0;
    SPIM_DMAM_SET_ACTSCLKT(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->DMMCTL & SPIM_DMMCTL_ACTSCLKT_Msk) >> SPIM_DMMCTL_ACTSCLKT_Pos) == 0x3);
    CU_ASSERT_TRUE(pSPIMModule->DMMCTL & SPIM_DMMCTL_UACTSCLK_Msk);

