wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    /*
     *  SPIM_PHDMM_CMD_DTR_ENABLE(x)/ SPIM_PHDMM_CMD_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_CMD_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_CMD_Msk) >> SPIM_PHDMM_DTR_CMD_Pos));
    SPIM_PHDMM_CMD_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_CMD_Msk) >> SPIM_PHDMM_DTR_CMD_Pos));

    /*
      *  SPIM_PHDMM_CMD_BIT_MODE(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_CMD_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_CMD_Msk) >> SPIM_PHDMM_BM_CMD_Pos) == 0x4);

    /*
     *  SPIM_PHDMM_ADDR_WIDTH(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_ADDR_Msk) >> SPIM_PHDMM_DW_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_ADDR_Msk) >> SPIM_PHDMM_DW_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_ADDR_Msk) >> SPIM_PHDMM_DW_ADDR_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_ADDR_Msk) >> SPIM_PHDMM_DW_ADDR_Pos) == 0x4);

    /*
     *  SPIM_PHDMM_ADDR_DTR_ENABLE(x)/ SPIM_PHDMM_ADDR_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_ADDR_Msk) >> SPIM_PHDMM_DTR_ADDR_Pos));
    SPIM_PHDMM_ADDR_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_ADDR_Msk) >> SPIM_PHDMM_DTR_ADDR_Pos));

    /*
      *  SPIM_PHDMM_ADDR_BIT_MODE(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_ADDR_Msk) >> SPIM_PHDMM_BM_ADDR_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_ADDR_Msk) >> SPIM_PHDMM_BM_ADDR_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_ADDR_Msk) >> SPIM_PHDMM_BM_ADDR_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_ADDR_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_ADDR_Msk) >> SPIM_PHDMM_BM_ADDR_Pos) == 0x4);

    /*
      *  SPIM_PHDMM_READ_DATA_WIDTH(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_DATA_WIDTH(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_MODE_Msk) >> SPIM_PHDMM_DW_MODE_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_DATA_WIDTH(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_MODE_Msk) >> SPIM_PHDMM_DW_MODE_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_DATA_WIDTH(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_MODE_Msk) >> SPIM_PHDMM_DW_MODE_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_DATA_WIDTH(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_DW_MODE_Msk) >> SPIM_PHDMM_DW_MODE_Pos) == 0x4);

    /*
     *  SPIM_PHDMM_READ_DTR_ENABLE(x)/ SPIM_PHDMM_READ_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_MODE_Msk) >> SPIM_PHDMM_DTR_MODE_Pos));
    SPIM_PHDMM_READ_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_MODE_Msk) >> SPIM_PHDMM_DTR_MODE_Pos));

    /*
      *  SPIM_PHDMM_READ_BIT_MODE(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_BIT_MODE(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_MODE_Msk) >> SPIM_PHDMM_BM_MODE_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_BIT_MODE(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_MODE_Msk) >> SPIM_PHDMM_BM_MODE_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_BIT_MODE(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_MODE_Msk) >> SPIM_PHDMM_BM_MODE_Pos) == 0x3);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_READ_BIT_MODE(pSPIMModule, 0x4);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_BM_MODE_Msk) >> SPIM_PHDMM_BM_MODE_Pos) == 0x4);

    /*
     *  SPIM_PHDMM_DATA_DTR_ENABLE(x)/ SPIM_PHDMM_DATA_DTR_DISABLE(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_DATA_DTR_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_DATA_Msk) >> SPIM_PHDMM_DTR_DATA_Pos));
    SPIM_PHDMM_DATA_DTR_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_DTR_DATA_Msk) >> SPIM_PHDMM_DTR_DATA_Pos));

    /*
     *  SPIM_PHDMM_DATA_RDQS_ENABLE(x)/ SPIM_PHDMM_DATA_RDQS_DISABLE(x)
     */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_DATA_RDQS_ENABLE(pSPIMModule);
    CU_ASSERT_TRUE(((pSPIMModule->PHDMM & SPIM_PHDMM_RDQS_DATA_Msk) >> SPIM_PHDMM_RDQS_DATA_Pos));
    SPIM_PHDMM_DATA_RDQS_DISABLE(pSPIMModule);
    CU_ASSERT_FALSE(((pSPIMModule->PHDMM & SPIM_PHDMM_RDQS_DATA_Msk) >> SPIM_PHDMM_RDQS_DATA_Pos));

    /*
      *  SPIM_PHDMM_RBO_DATA(x)
      */
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_RBO_DATA(pSPIMModule, 0x0);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_RBO_DATA_Msk) >> SPIM_PHDMM_RBO_DATA_Pos) == 0x0);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_RBO_DATA(pSPIMModule, 0x1);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_RBO_DATA_Msk) >> SPIM_PHDMM_RBO_DATA_Pos) == 0x1);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_RBO_DATA(pSPIMModule, 0x2);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_RBO_DATA_Msk) >> SPIM_PHDMM_RBO_DATA_Pos) == 0x2);
    pSPIMModule->PHDMM = 0;
    SPIM_PHDMM_RBO_DATA(pSPIMModule, 0x3);
    CU_ASSERT(((pSPIMModule->PHDMM & SPIM_PHDMM_RBO_DATA_Msk) >> SPIM_PHDMM_RBO_DATA_Pos) == 0x3);

