wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
        SPIM_DMA_Read(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf1, u32RdCmd, 1);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Erase DMA R/W - Flash address 0x%x, read 0x%x!\n", i, *pData);
                return -1;
            }
        }
    }

    /*
     *  Program data to flash block
     */
    spim->PHDMAW = (spim->PHDMAW & 0xFFFFFFFF) | 0x00000301;
    printf("pSPIMx->PHDMAW = 0x%08X\r\n", spim->PHDMAW);
    SPIM_SET_DC_DMAR(spim, 0);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);
        //pData = (uint32_t *)u8TstBuf1;

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //    (*pData) = (i << 16) | (offset + i);

        SPIM_DMA_Write(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf1, WrCmd);
    }

    /*
     *  Verify flash block data
     */
    spim->PHDMAR = (spim->PHDMAR & 0xFFFFFFFF) | 0x00000301;
    printf("pSPIMx->PHDMAR = 0x%08X\r\n", spim->PHDMAR);
    // Set Dummy Cycle After Address.
    SPIM_SET_DC_DMAR(spim, 0);

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        memset(u8TstBuf2, 0, BUFFER_SIZE);
        SPIM_DMA_Read(spim, offset, is4ByteAddr, BUFFER_SIZE, u8TstBuf2, u32RdCmd, 1);

        //pData = (uint32_t *)u8TstBuf1;

        // Compare.
        if (memcmp(&u8TstBuf1, &u8TstBuf2, BUFFER_SIZE))
        {
            printf("FAILED!\n");
            dump_compare_error(offset, u8TstBuf1, u8TstBuf2, BUFFER_SIZE);
            CU_FAIL();
            return -1;
        }

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //{
        //    if (*pData != ((i << 16) | (offset + i)))
        //    {
        //        printf("FAILED!\n");
        //        printf("DMA R/W - Flash address 0x%x, read 0x%x, expect 0x%x!\n",
        //               i,
        //               *pData,
        //               (i << 16) | (offset + i));
        //        CU_FAIL();
        //    }
        //}

    }

    printf("done.\n");
    return 0;
}

void SPIM_Basic_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    /* Unlock protected registers */
    //SYS_UnlockReg();

    //if (GetSPIMTestModuleIdx() == C_SPIM0)
    //{
    //    SYS_ResetModule(SYS_SPIM0RST);
    //}
    //else if (GetSPIMTestModuleIdx() == C_SPIM1)
    //{
    //    SYS_ResetModule(SYS_SPIM1RST);
    //}

    //SPIM_DISABLE_CIPHER(pSPIMModule);

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);        /* Set SPIM clock as HCLK divided by 2 */
    //SPIM_SET_DCNUM(pSPIMModule, 8);                /* 8 is the default value. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    if ((idBuf[0] != MFGID_WINBOND) &&
            (idBuf[0] != MFGID_MXIC) &&
            (idBuf[0] != MFGID_EON) &&
            (idBuf[0] != MFGID_ISSI) &&
            (idBuf[0] != MFGID_SPANSION) &&
            (idBuf[0] != MFGID_MICRON))
    {
        CU_FAIL();
    }
    else
    {
        CU_PASS();
    }
}

void SPIM_DMA_Func()
{
    SPIM_T *pSPIMModule = NULL;

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);        /* Set SPIM clock as HCLK divided by 2 */

    //SPIM_SET_DCNUM(8);                /* 8 is the default value. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_ReadJedecId(pSPIMModule, idBuf, sizeof(idBuf), 1);
    printf("SPIM get JEDEC ID=0x%02X, 0x%02X, 0x%02X\n", idBuf[0], idBuf[1], idBuf[2]);

    if (dma_read_write(pSPIMModule, 0, CMD_NORMAL_READ, CMD_NORMAL_PAGE_PROGRAM, 8) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

#if 0

    if (dma_read_write(1, CMD_DMA_FAST_READ, CMD_NORMAL_PAGE_PROGRAM_4B, 8) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

#endif

    CU_PASS();
}

void SPIM_Chip_Erase_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 2 */

    //SPIM_SET_DCNUM(pSPIMModule, 8);                /* 8 is the default value. */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    if (dma_read_write(pSPIMModule, 0, CMD_FAST_READ, CMD_NORMAL_PAGE_PROGRAM, 8) < 0)
    {
        printf("dma_read_write FAILED!!\n");
        CU_FAIL();
    }

    printf("Doing Chip Erase...\n");
    SPIM_ChipErase(pSPIMModule, 1, 1);
    printf("Chip Erase done.\n");

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        SPIM_DMA_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, CMD_FAST_READ, 1);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Chip Erase - Flash address 0x%x, read 0x%x!\n", i, *pData);
                CU_FAIL();
            }
        }
    }

    printf("DMA Test done.\n");
    CU_PASS();
}

void SPIM_IO_WriteFunc()
{
    uint32_t offset = 0;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();

