wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Program data to flash block
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);
        //pData = (uint32_t *)g_buff;

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //    * pData = (i << 16) | (offset + i);

        SPIM_IO_Write(pSPIMModule,
                      offset,
                      0,
                      BUFFER_SIZE,
                      u8TstBuf1,
                      CMD_QUAD_PAGE_PROGRAM_WINBOND,
                      SPIM_GetIOPhaseSize(PHASE_NORMAL_MODE),
                      SPIM_GetIOPhaseSize(PHASE_NORMAL_MODE),
                      SPIM_GetIOPhaseSize(PHASE_QUAD_MODE));
        //SPIM_IO_Write(pSPIMModule, offset, 0, BUFFER_SIZE, g_buff, OPCODE_PP, 1, 1, 1);
    }

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);
}

void SPIM_IO_RW_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);       /* Set SPIM clock as HCLK divided by 4 */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    SPIM_Enable_4Bytes_Mode(pSPIMModule, 0, 1);

    CU_ASSERT(SPIM_Is4ByteModeEnable(pSPIMModule, 1) == 0);

    /*
     *  Erase flash page
     */
    //SPIM_EraseBlock(pSPIMModule, 0, 0, OPCODE_BE_64K, 1, 1);
    SPIM_EraseAddrRange(pSPIMModule, 0, 0, FLASH_PAGE_SIZE, OPCODE_BE_64K, FLASH_PAGE_SIZE, 1);

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    /*
     *  Verify flash page be erased
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        memset(u8TstBuf1, 0, BUFFER_SIZE);
        //SPIM_IO_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf1, 0xeb, 1, 4, 4, 3, 0);
        SPIM_IO_CMDPhase(pSPIMModule, 0xEB, PHASE_NORMAL_MODE, 0, 0);
        SPIM_IO_AddrPhase(pSPIMModule, 0, offset, PHASE_QUAD_MODE, 0);
        SPIM_IO_DCPhase(pSPIMModule, 2, PHASE_QUAD_MODE, 0);
        SPIM_IO_DataPhase(pSPIMModule, u8TstBuf1, BUFFER_SIZE, PHASE_QUAD_MODE, 0, 0);

        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (*pData != 0xFFFFFFFF)
            {
                printf("FAILED!\n");
                printf("Erase I/O RW - Flash address 0x%x, read 0x%x!\n", i, *pData);
                CU_FAIL();
            }
        }
    }

    /*
     *  Program data to flash block
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);
        //pData = (uint32_t *)u8TstBuf1;

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //    * pData = (i << 16) | (offset + i);

        SPIM_IO_Write(pSPIMModule,
                      offset,
                      0,
                      BUFFER_SIZE,
                      u8TstBuf1,
                      CMD_QUAD_PAGE_PROGRAM_WINBOND,
                      SPIM_GetIOPhaseSize(PHASE_NORMAL_MODE),
                      SPIM_GetIOPhaseSize(PHASE_NORMAL_MODE),
                      SPIM_GetIOPhaseSize(PHASE_QUAD_MODE));
        //SPIM_IO_Write(pSPIMModule, offset, 0, BUFFER_SIZE, g_buff, OPCODE_PP, 1, 1, 1);
    }

    /*
     *  Read and compare flash data
     */
    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        popDat(u8TstBuf1, BUFFER_SIZE);

        memset(u8TstBuf2, 0, BUFFER_SIZE);
        //SPIM_IO_Read(pSPIMModule, offset, 0, BUFFER_SIZE, u8TstBuf2, 0xeb, 1, 4, 4, 3, 0);
        SPIM_IO_CMDPhase(pSPIMModule, 0xEB, PHASE_NORMAL_MODE, 0, 0);
        SPIM_IO_AddrPhase(pSPIMModule, 0, offset, PHASE_QUAD_MODE, 0);
        SPIM_IO_DCPhase(pSPIMModule, 2, PHASE_QUAD_MODE, 0);
        SPIM_IO_DataPhase(pSPIMModule, u8TstBuf2, BUFFER_SIZE, PHASE_QUAD_MODE, 0, 0);

        // Compare.
        if (memcmp(&u8TstBuf1, &u8TstBuf2, BUFFER_SIZE))
        {
            printf("FAILED!\n");
            dump_compare_error(offset, u8TstBuf1, u8TstBuf2, BUFFER_SIZE);
            CU_FAIL();
        }

        //pData = (uint32_t *)g_buff;

        //for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        //{
        //    if (*pData != ((i << 16) | (offset + i)))
        //    {
        //        printf("FAILED!\n");
        //        printf("I/O RW - Flash address 0x%x, read 0x%x, expect 0x%x!\n", i, *pData, (i << 16) | (offset + i));
        //        CU_FAIL();
        //    }
        //}
    }

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);

    printf("IO Test done.\n");
    CU_PASS();
}

void SPIM_DMM_Func()
{
    int        i, offset;
    uint32_t   *pData;
    SPIM_T *pSPIMModule = NULL;
    uint8_t *u8TstBuf1 = (uint8_t *)GetTestBuffer1();
    uint8_t *u8TstBuf2 = (uint8_t *)GetTestBuffer2();

    pSPIMModule = (SPIM_T *)GetSPIMModule(GetSPIMTestModuleIdx());

    //SPIM_SET_CLOCK_DIVIDER(pSPIMModule, 10);        /* Set SPIM clock as HCLK divided by 2 */

    if (SPIM_InitFlash(pSPIMModule, 1) != 0)        /* Initialized SPI flash */
    {
        printf("SPIM flash initialize failed!\n");
        CU_FAIL();
    }

    //if (dma_read_write(pSPIMModule, 0, CMD_FAST_READ, CMD_NORMAL_PAGE_PROGRAM, 8) < 0)
    //{
    //    printf("dma_read_write FAILED!!\n");
    //    CU_FAIL();
    //}
    SPIM_IO_WriteFunc();

    //SPIM_EnterDirectMapMode(pSPIMModule, 0, CMD_FAST_READ, 8);
    pSPIMModule->PHDMM = (pSPIMModule->PHDMM & 0xFFFFFFFF) | 0x20212301;
    printf("pSPIMx->PHDMM = 0x%08X\r\n", pSPIMModule->PHDMM);
    // Set Dummy Cycle After Address.
    SPIM_SET_DC_DMM(pSPIMModule, 4);

    SPIM_SetQuadEnable(pSPIMModule, 1, 1);

    SPIM_EnterDirectMapMode(pSPIMModule, 0, 0xEB, 0);  // Switch to Direct Map mode.cmd_idx].u32CMD, idlIntvl);     // Switch to Direct Map mode.

    for (offset = 0; offset < FLASH_BLOCK_SIZE; offset += BUFFER_SIZE)
    {
        if (GetSPIMTestModuleIdx() == C_SPIM0)
        {
            memcpy(u8TstBuf1, (uint8_t *)(SPIM0_DMM_MAP_ADDR + offset), BUFFER_SIZE);
        }
        else if (GetSPIMTestModuleIdx() == C_SPIM1)
        {
            memcpy(u8TstBuf1, (uint8_t *)(SPIM1_DMM_MAP_ADDR + offset), BUFFER_SIZE);
        }

        popDat(u8TstBuf1, BUFFER_SIZE);

