wosayttn/M55M1BSP/_CUnit/spim/spim_cunit.c
        pData = (uint32_t *)u8TstBuf1;

        for (i = 0; i < BUFFER_SIZE; i += 4, pData++)
        {
            if (inpw(SPIM0_DMM_MAP_ADDR + offset + i) != *pData)
            {
                printf("FAILED!\n");
                printf("DMM - Flash address 0x%x, read 0x%x, expect 0x%x!\n",
                       i,
                       *pData,
                       (i << 16) | (offset + i));
                SPIM_ExitDirectMapMode(pSPIMModule);
                CU_FAIL();
            }

            //if (*pData != ((i << 16) | (offset + i)))
            //{
            //    printf("FAILED!\n");
            //    printf("DMM - Flash address 0x%x, read 0x%x, expect 0x%x!\n", i, *pData, (i << 16) | (offset + i));
            //    SPIM_ExitDirectMapMode(pSPIMModule);
            //    CU_FAIL();
            //}
        }
    }

    SPIM_ExitDirectMapMode(pSPIMModule);

    SPIM_SetQuadEnable(pSPIMModule, 0, 1);

    printf("DMM Test done.\n");
    CU_PASS();
}

CU_TestInfo SPIM_ConstantTests[] =
{
    {"SPIM CONST Address", SPIM_Const_Address},
    {"SPIM CONST SPIM_CTL0", SPIM_Const_SPIM_CTL0},
    {"SPIM CONST SPIM_CMDCODE", SPIM_Const_SPIM_CMDCODE},
    {"SPIM CONST SPIM_PHASE", SPIM_Const_SPIM_PHASE},
    {"SPIM CONST MFGID", SPIM_Const_MFGID},
    {"SPIM CONST OPCODE", SPIM_Const_OPCODE},
    {"SPIM CONST Register", SPIM_Const_Register},
    CU_TEST_INFO_NULL
};

CU_TestInfo SPIM_MacroTests[] =
{
    {"SPIM_CTL0 Macros", MACRO_SPIM_CTL0},
    {"SPIM_CTL1 Macros", MACRO_SPIM_CTL1},
    {"SPIM_RXCLKDLY Macros", MACRO_SPIM_RXCLKDLY},
    {"SPIM_DMMCTL Macros", MACRO_SPIM_DMMCTL},
    {"SPIM_CTL2 Macros", MACRO_SPIM_CTL2},
    {"SPIM_PHDMAW Macros", MACRO_SPIM_DMA_WRITE_PHASE},
    {"SPIM_PHDMAR Macros", MACRO_SPIM_DMA_READ_PHASE},
    {"SPIM_PHDMM Macros", MACRO_SPIM_DMM_PHASE},
    {"SPIM_DLL0 Macros", MACRO_SPIM_DLL0},
    {"SPIM_DLL1 Macros", MACRO_SPIM_DLL1},
    {"SPIM_DLL2 Macros", MACRO_SPIM_DLL2},
    {"SPIM_GetSClkFreq Macros", MACRO_SPIM_GetSClkFreq},
    CU_TEST_INFO_NULL,
};

CU_TestInfo SPIM_ApiTests[] =
{
    {"SPIM Init/Read ID Function", SPIM_Basic_Func},
    {"SPIM DMA Function", SPIM_DMA_Func},
    {"SPIM I/O Read/Write Function", SPIM_IO_RW_Func},
    {"SPIM DMM Function", SPIM_DMM_Func},
    //   {"SPIM Chip Erase", SPIM_Chip_Erase_Func},
    CU_TEST_INFO_NULL
};
